# ShowCreateImageDialog

## Description
Displays a dialog that allows the user to select an image file from which a new image resource is created.

```pascal
FUNCTION ShowCreateImageDialog : HANDLE;
```

```python
def vs.ShowCreateImageDialog():
    return HANDLE
```

## Examples
==== VectorScript ====
```pascal
imageHandle := ShowCreateImageDialog;
```
==== Python ====
```python

```

## Version
Availability: from VectorWorks10.0

## Category
* Document Attributes